Tester/src/Catalogs/ErrorLog/ErrorLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ErrorLog</name>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FullText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Line</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Row</name>
    <type>
      <types>DefinedType.LineNumber</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Versions</types>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Screenshot</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ScreenshotExists</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Stack</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/CommonModules/ErrorLogForm/Module.bsl
&AtServer
Procedure UpdateStack ( Error, Stack ) export
	
	Stack.Clear ();
	table = getStack ( Error );
	for each row in table do
		newRow = Stack.Add ();
		newRow.Scenario = row.Scenario + " [" + Format ( row.Row, "NG=" ) + "]";
		newRow.Ref = row.Ref;
		newRow.Row = row.Row;
	enddo; 
	
EndProcedure

&AtServer
Function getStack ( Error )
	
	s = "
	|select Stack.Row as Row, Stack.Scenario as Ref, presentation ( Stack.Scenario ) as Scenario
	|from Catalog.ErrorLog.Stack as Stack
	|where Stack.Ref = &Ref
	|order by Stack.LineNumber
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Error );
	return q.Execute ().Unload ();
	
EndFunction

&AtClient
Procedure OpenScenario ( Stack ) export
	
	data = Stack.CurrentData;
	ScenarioForm.GotoLine ( data.Ref, data.Row );
	
EndProcedure
